{
  "films": [
    {
      "id": 1,
      "title": "Добыча",
      "genre": "Драмы, Триллеры, Фантастика, Боевики",
      "categoryId": 1,
      "year": "2022",
      "director": "Дэн Трахтенберг",
      "roles": "Эмбер Мидфандер, Дакота Биверс, Дэйн ДиЛьегро, Мишель Траш, Майк Патерсон",
      "description": "История фильма Добыча берёт своё начало в 1719 году.В центре истории приквела оказывается юная Нару, член племени команчей, мечтающая стать охотником, как и её брат Таабе. Но проблема в том, что в их племени правят традиционные обычаи, запрещающие женщинам быть сильными охотницами. Но Нару собирается сломить жёсткий патриархат, доказав, что женщина может делать всё то же, что и мужчина.",
      "image": "dobycha.jpg",
      "url": "dobycha",
      "imdb": "5.0"
    },
    {
      "id": 2,
      "title": "Бегущий человек",
      "genre": "Триллеры, Фантастика, Приключения, Боевики",
      "categoryId": 1,
      "year": "2025",
      "director":"Эдгар Райт",
      "roles": "Джош Бролин, Глен Пауэлл, Кэти М. О’Брайан, Ли Пейс, Карл Глусман",
      "description": "Ближайшее будущее. Отчаявшийся отец Бен Ричардс решает принять участие в жестоком реалити-шоу «Бегущий человек», рассчитывая выиграть деньги для лечения своей тяжело больной дочери. Чтобы победить, участники должны выжить на протяжении 30 дней, находясь под неустанной охотой группы убийц.",
      "image": "beguschiy-chelovek.jpg",
      "url": "beguschiy-chelovek",
      "imdb": "6.8"
    },
    {
      "id": 3,
      "title": "Аватар: Пламя и пепел",
      "genre": "Триллеры, Фантастика, Фэнтези, Приключения, Боевики",
      "categoryId": 1,
      "year": "2025",
      "director": "Джеймс Кэмерон",
      "roles": "Кейт Уинслет, Стивен Лэнг, Зои Салдана, Сэм Уортингтон, Иди Фалько",
      "description": "Джейк Салли, Нейтири и их дети переживают утрату Нетейама. Его смерть оставила семью в глубокой скорби и потрясении: дом наполнился пустотой, а каждый вечер стал испытанием воспоминаний и нерешённых слов. Горе сплачивает их, но одновременно обнажает страхи за будущее — кто теперь станет опорой клана, как сохранить традиции и защитить детей от новых опасностей.",
      "image": "avatar-plamya-i-pepel.jpg",
      "url": "avatar-plamya-i-pepel",
      "imdb": "7.5"
    },
    {
      "id": 4,
      "title": "Точка замерзания",
      "genre": "Триллеры, Криминал, Боевики",
      "categoryId": 1,
      "year": "2025",
      "director": "Брайан Кирк",
      "roles": "Эмма Томпсон, Джуди Грир, Марк Менчака, Гайа Уайз, Брайан Ф. О’Бирн",
      "description": "Ледяная пустошь Миннесоты не место для случайных визитёров - здесь могут выжить и обустроиться только самые подготовленные. Так что когда в этот суровый и холодный край приезжает молодая пара, всё внимание местных жителей сразу сосредотачивается на них. Женщина-рыболов Барб, которая живёт здесь изгоем, узнаёт, что новоприбывшие удерживают в заложниках совсем юную девушку. Чтобы освободить её, женщине придется заручиться всем своим опытом выживания и бросить вызов надвигающейся метели.",
      "image": "tochka-zamerzaniya.jpg",
      "url": "tochka-zamerzaniya",
      "imdb": "5.7"
    },
    {
      "id": 5,
      "title": "Фоллаут",
      "genre": "Драмы, Фантастика, Приключения, Боевики",
      "categoryId": 2,
      "year": "2024-2025",
      "director": "Джонатан Нолан",
      "roles": "Аарон Мотен, Мойзес Ариас, Элла Пернелл, Уолтон Гоггинс, Джонни Пембертон",
      "description": "Сериал \"Fallout\" основан на популярной серии видеоигр и переносит зрителей в постапокалиптический мир 1940-х годов. Действие разворачивается в 2161 году, спустя десятки лет после ядерного конфликта. Главным местом событий является территория постапокалиптических США, известная как Пустошь. Несмотря на футуристическое окружение, жители этого мира живут в атмосфере ретрофутуризма 1950-х годов, что создает уникальную атмосферу сериала.",
      "image": "follaut.jpg",
      "url": "follaut",
      "imdb": "8.8"
    },
    {
      "id": 6,
      "title": "Очень странные дела",
      "genre": "Драмы, Триллеры, Ужасы, Фантастика, Фэнтези, Детектив",
      "categoryId": 2,
      "year": "2016-2025",
      "director": "Мэтт Даффер",
      "roles": "Милли Бобби Браун, Финн Вулфхард, Гейтен Матараццо, Калеб Маклафлин, Ноа Шнапп",
      "description": "Действие сериала \"Очень странные дела\" смотреть начинается в маленьком провинциальном городке в восьмидесятых годах прошлого века. Жизнь течет здесь лениво и неспешно. Интересных событий мало. Но однажды таки происходит что-то из ряда вон выходящее. При странных обстоятельствах без вести пропадает подросток Уилл. Местный шериф начинает поиски и сталкивается с группой странных людей. Шериф подозревает, что они скорее всего причастны к пропаже Уилла, однако прямых улик у него нет.",
      "image": "ochen-strannye-dela.jpg",
      "url": "ochen-strannye-dela",
      "imdb": "7.9"
    },
    {
      "id": 7,
      "title": "Игра престолов",
      "genre": "Драмы,  Фэнтези,  Мелодрама,  Приключения Боевики",
      "categoryId": 2,
      "year": "2011-2019",
      "director": "Дэвид Наттер, Алан Тейлор, Алекс Грейвз, Мигель Сапочник",
      "roles": "Питер Динклэйдж, Лина Хиди, Эмилия Кларк, Кит Харингтон, Софи Тёрнер",
      "description": "Сериал «Игра престолов» погружает зрителей в новый мир, который отдаленно напоминает средневековую Европу, с ее жестокими нравами и обычаями. Вам лишь остается смотреть, затаив дыхание, как на экране разворачивается кровавая борьба между Старками и Ланнистерами – двумя влиятельными семействами, которые готовы пойти на все ради власти.",
      "image": "igry-prestolov.jpg",
      "url": "igry-prestolov",
      "imdb": "8.5"
    },
    {
      "id": 8,
      "title": "Сверхъестественное",
      "genre": "Драмы,  Триллеры,  Ужасы,  Фэнтези,  Боевики,  Детектив",
      "categoryId": 2,
      "year": "2005-2020",
      "director": "Роберт Сингер, Филип Сгриккиа, Джон Шоуолтер",
      "roles": "Джаред Падалеки, Дженсен Эклс, Джим Бивер, Миша Коллинз, Марк Шеппард",
      "description": "Сериал «Сверхъестественное», повествующий историю двух братьев, завоевал любовь многих зрителей по всему миру, и который однозначно стоит смотреть. Дин и Сэм, которые рано потеряли мать при странном пожаре в далеком прошлом, пытаются вместе найти своего отца Джона. Так начинается их путешествие по бескрайним просторам Америки. По пути им встречается разная нечисть, с которой им приходится сражаться. Только объединив усилия, братья смогут спасти отца и дать отпор темным силам.",
      "image": "swerhestestvennoe.jpg",
      "url": "swerhestestvennoe",
      "imdb": "7.2"
    },
    {
      "id": 9,
      "title": "Пожиратель звёзд",
      "genre": "Аниме, Фантастика, Приключения",
      "categoryId": 3,
      "year": "2020-2025",
      "director": "Шэнь Лэпин",
      "roles": "Чжао Цяньцзин",
      "description": "На Земле появился вирус RR, который бросил мир в пучину отчаяния. Животные, которые оказывались зараженными, превращались в чудовищ и бросались на людей. У человечества не было выбора, кроме как отступить с поверхности и начать жизнь на подземных базах. Этот период запомнили как \"Эру Нирваны\". Выживая в невероятных условиях, люди адаптировались и стали сильнее, их тела стали куда крепче и выносливее, чем раньше. Лучших рекрутов стали называть \"Бойцами\". 18-тилетний Луо Фэн всю жизнь мечтал стать одним из них. Его ждали экзамены, которые решат всю его дальнейшую жизнь, но нападение монстров изменило его навсегда. Горожане ничего не могли сделать сами, у армии тоже не осталось сил, чтобы помочь населению.\n\nИменно тогда появился Герой, который смог в одиночку справиться с нападением. Решимость защищать людей и сила героя произвела на Луо Фэн глубокое впечатление, и он решил стать одним из Бойцов во что бы то ни стало. Но стать героем не так-то просто, и часто сама жизнь будто пытается вставить палки в колёса. Луо Фэн из бедной семьи, родители мало чем могут ему помочь, так что ему приходится самостоятельно развивать свои скрытые таланты. Так, со временем, он станет не только защитником своей семьи, но и защитником всего человечества. Смогут ли Луо Фэн и другие Борцы отбить нападение монстров и защитить человечество?",
      "image": "pozhiratel-zvezd.jpg",
      "url": "pozhiratel-zvezd",
      "imdb": "7.9"
    },
    {
      "id": 10,
      "title": "Расколотая Битвой Синева Небес",
      "genre": "Аниме, Фэнтези, Приключения",
      "categoryId": 3,
      "year": "2017-2025",
      "director": "",
      "roles": "",
      "description": "История Сяо Яня обещает быть захватывающей и полной приключений. Давайте узнаем, как он восстанавливает свое могущество и репутацию, чтобы защитить свою семью.\n\nСяо Янь, когда-то был известным и талантливым воином, чьи навыки превосходили других уже несколько поколений. Однако за последние три года он потерял все свои способности и репутацию. Он жил спокойной жизнью со своей семьей, но теперь они оказались под угрозой и ему требовалось вернуть свое сильное могущество, чтобы их защитить.",
      "image": "raskolotaya-bitvoy-sineva-nebes.jpg",
      "url": "raskolotaya-bitvoy-sineva-nebes",
      "imdb": "8.2"
    },
    {
      "id": 11,
      "title": "Трон, отмеченный богом",
      "genre": "Фэнтези, Мелодрама, Приключения, Боевики",
      "categoryId": 3,
      "year": "2022-2025",
      "director": "Цзэн Юаньцзюнь",
      "roles": "Е Чжицю, Янь Мэмэ, Тэн Синь, Лю Минъюэ",
      "description": "В мире, охваченном хаосом и опасностью из-за появления демонов и богов-демонов, будущее человечества висит на волоске. В ответ на эту угрозу, 6 храмов решили объединить усилия, чтобы спасти мир от неминуемой гибели. Великая война началась, и в этот момент маленький мальчик принял решение присоединиться к одному из храмов и стать рыцарем, чтобы спасти свою мать и обеспечить будущее для человечества.",
      "image": "tron-otmechennyy-bogom.jpg",
      "url": "tron-otmechennyy-bogom",
      "imdb": "7.9"
    },
    {
      "id": 12,
      "title": "Безупречный мир",
      "genre": "Фэнтези, Приключения, Боевики",
      "categoryId": 3,
      "year": "2021-2025",
      "director": "",
      "roles": "",
      "description": "Ши Хао, некогда лишённый всего, рос в отдалённой деревушке, не помня ничего о своём прошлом. Деревенские жители заботились о нём, но они не могли заменить ему родителей. Каждый раз, видя как другие дети весело проводят время со своими мамами и папами, Ши Хао становилось грустно. Он вспоминал своих родителей, которые почему-то ушли и оставили его одного. Он даже не мог вспомнить их лиц, что делало его ещё более печальным. Ши Хао хотел знать, почему они так поступили и где они сейчас. Его переполняло желание встретиться с ними, но чтобы получить ответы, ему нужно было пробудить воспоминания, дремлющие в глубинах его сознания. Для этого он должен стать гораздо сильнее, и он станет, ведь у парнишки огромный потенциал!",
      "image": "bezuprechnyy-mir.jpg",
      "url": "bezuprechnyy-mir",
      "imdb": "7.8"
    }

  ],
  "categories": [
    {
      "id": 1,
      "name": "Фильм",
      "url": "film"
    },
    {
      "id": 2,
      "name": "Сериал",
      "url": "series"
    },
    {
      "id": 3,
      "name": "Мультфильм",
      "url": "cartoon"
    }
  ]
}
